LiteOS/LiteOS/targets/Cloud_FM33A0XX/Device/IncludeIAR/FM33A0XX.h
/* ================================================================================ */
/* ================                      ANAC                      ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t PDRCON;   				/*!< ANAC PDR CONFIG REGISTER,       			Address offset: 0x00 */
	__IO uint32_t BORCON;   				/*!< ANAC BOR CONFIG REGISTER, 						Address offset: 0x04 */
	__IO uint32_t LDO15CON;  				/*!< ANAC LDO15CON CONFIG REGISTER,  			Address offset: 0x08 */
	__IO uint32_t VREFTRIM;					/*!< ANAC VREF TRIM REGISTER,      				Address offset: 0x0C */
	__IO uint32_t ULPRCON;					/*!< ANAC ULP LDO CONFIG REGISTER,	 			Address offset: 0x10 */
	__IO uint32_t SVDCFG;					/*!< ANAC SVD CONFIG REGISTER,	 					Address offset: 0x14 */
	__IO uint32_t SVDCON;					/*!< ANAC SVD CONTROL REGISTER,			 			Address offset: 0x18 */
	__IO uint32_t SVDSIF;					/*!< ANAC SVD INTERRUPT FLAG REGISTER,		Address offset: 0x1C */
	__IO uint32_t FDETIE;					/*!< ANAC FDET INTERRUPT ENABLE REGISTER,	Address offset: 0x20 */
	__IO uint32_t FDETIF;					/*!< ANAC FDET INTERRUPT FLAG REGISTER,		Address offset: 0x24 */
	__IO uint32_t ADCINSEL;					/*!< ANAC INPUT SELECT REGISTER,						Address offset: 0x28 */
	__IO uint32_t ADCCON;					/*!< ANAC ADC CONFIG REGISTER,						Address offset: 0x2C */
	__IO uint32_t ADCTRIM;					/*!< ANAC ADC TRIM REGISTER,							Address offset: 0x30 */
	__IO uint32_t ADCDATA;					/*!< ANAC ADC DATA REGISTER,							Address offset: 0x34 */
	__IO uint32_t ADCIF;					/*!< ANAC ADC INTERRUPT FLAG REGISTER,		Address offset: 0x38 */
	__IO uint32_t TRNGCON;					/*!< ANAC TRNF ENABLE REGISTER,						Address offset: 0x3C */
	__IO uint32_t COMP1CR;					/*!< ANAC COMP1 CONTROL REGISTER,					Address offset: 0x40 */
	__IO uint32_t COMP2CR;					/*!< ANAC COMP2 CONTROL REGISTER,					Address offset: 0x44 */
	__IO uint32_t COMPICR;					/*!< ANAC COMP12 INTERRUPT CONTROL REGISTER,		Address offset: 0x48 */
	__IO uint32_t COMPIF;					/*!< ANAC COMP INTERRUPT FLAG REGISTER,		Address offset: 0x4C */
	__IO uint32_t RSV0;
	__IO uint32_t RSV1;
	__IO uint32_t RSV2;	
	__IO uint32_t SVDALM;					/*!< ANAC SVDALM REGISTER,			Address offset: 0x5C */
} ANAC_Type;

/* ================================================================================ */
/* ================                      CRC                      ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t CRCDR;   					/*!< CRC DATA  REGISTER,       					Address offset: 0x00 */
	__IO uint32_t CRCCR;   					/*!< CRC CONTROL REGISTER, 							Address offset: 0x04 */
	__IO uint32_t CRCLFSR;  				/*!< CRC LFSR REGISTER,  								Address offset: 0x08 */
	__IO uint32_t CRCXOR;					/*!< CRC XOR DATA REGISTER,      				Address offset: 0x0C */
	__IO uint32_t CRCFLSEN;					/*!< CRC FLASH CRC VERIFY EN REGISTER,	Address offset: 0x10 */
	__IO uint32_t CRCFLSAD;					/*!< CRC FLASH ADRESS REGISTER,	 				Address offset: 0x14 */
	__IO uint32_t CRCFLSSIZE;				/*!< CRC VERIFY SIZE REGISTER,					Address offset: 0x18 */
} CRC_Type;


/* ================================================================================ */
/* ================                      DISP                      ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t DISPCTRL;   				/*!< DISP CONTROL REGISTER,    					Address offset: 0x00 */
	__IO uint32_t LCDTEST;   				/*!< DISP TEST CONTROL REGISTER, 				Address offset: 0x04 */
	__IO uint32_t DF;  						/*!< DISP DIVIDE CLK SETTING REGISTER,  Address offset: 0x08 */
	__IO uint32_t TON;						/*!< DISP ON SETTING REGISTER,      		Address offset: 0x0C */
	__IO uint32_t TOFF;						/*!< DISP OFF SETTING REGISTER,					Address offset: 0x10 */
	__IO uint32_t DISPIE;					/*!< DISP INTERRUPT CONTROL REGISTER,	 	Address offset: 0x14 */
	__IO uint32_t DISPIF;					/*!< DISP INTERRUPT FLAG REGISTER,			Address offset: 0x18 */
	__IO uint32_t LCDSET;					/*!< DISP SETTING REGISTER,							Address offset: 0x1C */	
	__IO uint32_t LCDDRV;					/*!< DISP DRV SETTING REGISTER,					Address offset: 0x20 */	
	__IO uint32_t DISPDATA0;				/*!< DISP DATA REGISTER 0,							Address offset: 0x24 */	
	__IO uint32_t DISPDATA1;				/*!< DISP DATA REGISTER 1,							Address offset: 0x28 */
	__IO uint32_t DISPDATA2;				/*!< DISP DATA REGISTER 2,							Address offset: 0x2C */
	__IO uint32_t DISPDATA3;				/*!< DISP DATA REGISTER 3,							Address offset: 0x30 */
	__IO uint32_t DISPDATA4;				/*!< DISP DATA REGISTER 4,							Address offset: 0x34 */
	__IO uint32_t DISPDATA5;				/*!< DISP DATA REGISTER 5,							Address offset: 0x38 */
	__IO uint32_t DISPDATA6;				/*!< DISP DATA REGISTER 6,							Address offset: 0x3C */
	__IO uint32_t DISPDATA7;				/*!< DISP DATA REGISTER 7,							Address offset: 0x40 */
	__IO uint32_t DISPDATA8;				/*!< DISP DATA REGISTER 8,							Address offset: 0x44 */
	__IO uint32_t DISPDATA9;				/*!< DISP DATA REGISTER 9,							Address offset: 0x48 */
	__IO uint32_t LCDBIAS;					/*!< DISP BIAS SETTING REGISTER,				Address offset: 0x4C */
	__IO uint32_t COM_EN;					/*!< DISP COM SETTING REGISTER,					Address offset: 0x50 */
	__IO uint32_t SEG_EN0;					/*!< DISP SEG SETTING REGISTER,					Address offset: 0x54 */
	__IO uint32_t SEG_EN1;					/*!< DISP SEG SETTING REGISTER,					Address offset: 0x58 */
	__IO uint32_t LCDBSTCON;				/*!< DISP BOOST CONFIG REGISTER,				Address offset: 0x5C */
	
} DISP_Type;

/* ================================================================================ */
/* ================                      RTC                      ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t RTCWE;   					/*!< RTC WRITE PROTECT REGISTER,    		Address offset: 0x00 */
	__IO uint32_t RTCIE;   					/*!< RTC INTERRUPT CONTROL REGISTER, 		Address offset: 0x04 */
	__IO uint32_t RTCIF;  					/*!< RTC INTERRUPT FLAG REGISTER,  			Address offset: 0x08 */
	__IO uint32_t BCDSEC;					/*!< RTC SECOND IN BCD REGISTER,      	Address offset: 0x0C */
	__IO uint32_t BCDMIN;					/*!< RTC MINITE IN BCD REGISTER,				Address offset: 0x10 */
	__IO uint32_t BCDHOUR;					/*!< RTC HOUR IN BCD REGISTER,	 				Address offset: 0x14 */
	__IO uint32_t BCDDATE;					/*!< RTC DATE IN BCD REGISTER,					Address offset: 0x18 */
	__IO uint32_t BCDWEEK;					/*!< RTC WEEK IN BCD REGISTER,					Address offset: 0x1C */	
	__IO uint32_t BCDMONTH;					/*!< RTC MONTH IN BCD REGISTER,					Address offset: 0x20 */	
	__IO uint32_t BCDYEAR;					/*!< RTC YEAR IN BCD REGISTER,					Address offset: 0x24 */	
	__IO uint32_t ALARM;					/*!< RTC ALARM SETTING REGISTER,				Address offset: 0x28 */
	__IO uint32_t FSEL;						/*!< RTC OUTPUT SELECT REGISTER,				Address offset: 0x2C */
	__IO uint32_t ADJUST;					/*!< RTC LTBC ADJUST REGISTER,					Address offset: 0x30 */
	__IO uint32_t ADSIGN;					/*!< RTC LTBC ADJUST SIGN REGISTER,			Address offset: 0x34 */
	__IO uint32_t PR1SEN;					/*!< RTC LTBC 1SEC ENABLE REGISTER,			Address offset: 0x38 */
	__IO uint32_t MSECCNT;					/*!< RTC MS COUNTER REGISTER,						Address offset: 0x3C */
	__IO uint32_t STAMPEN;					/*!< RTC TIME STAMP REGISTER,						Address offset: 0x40 */
	__IO uint32_t CLKSTAMP0R;				/*!< RTC STAMP AT PB4 RISE REGISTER 0,	Address offset: 0x44 */
	__IO uint32_t CALSTAMP0R;				/*!< RTC STAMP AT PB4 RISE REGISTER 0,	Address offset: 0x48 */
	__IO uint32_t CLKSTAMP0F;				/*!< RTC STAMP AT PB4 FALL REGISTER 0,	Address offset: 0x4C */
	__IO uint32_t CALSTAMP0F;				/*!< RTC STAMP AT PB4 FALL REGISTER 0,	Address offset: 0x50 */
	__IO uint32_t CLKSTAMP1R;				/*!< RTC STAMP AT PB4 RISE REGISTER 1,	Address offset: 0x54 */
	__IO uint32_t CALSTAMP1R;				/*!< RTC STAMP AT PB4 RISE REGISTER 1,	Address offset: 0x58 */
	__IO uint32_t CLKSTAMP1F;				/*!< RTC STAMP AT PB4 FALL REGISTER 1,	Address offset: 0x5C */
	__IO uint32_t CALSTAMP1F;				/*!< RTC STAMP AT PB4 FALL REGISTER 1,	Address offset: 0x60 */	
} RTC_Type;

/* ================================================================================ */
/* ================                      AES                       ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t AESCR;   					/*!< AES CONTROL REGISTER,    				Address offset: 0x00 */
	__IO uint32_t AESIF;   					/*!< AES INTERRUPT FLAG REGISTER, 			Address offset: 0x04 */
	__IO uint32_t AESDIN;  					/*!< AES DATA INPUT REGISTER,  				Address offset: 0x08 */
	__IO uint32_t AESDOUT;					/*!< AES DATA OUTPUT REGISTER,      		Address offset: 0x0C */
	__IO uint32_t AESKEY0;					/*!< AES KEY LOW WORD REGISTER 0,			Address offset: 0x10 */
	__IO uint32_t AESKEY1;					/*!< AES KEY REGISTER 1,	 				Address offset: 0x14 */
	__IO uint32_t AESKEY2;					/*!< AES KEY REGISTER 2,					Address offset: 0x18 */
	__IO uint32_t AESKEY3;					/*!< AES KEY REGISTER 3,					Address offset: 0x1C */	
	__IO uint32_t AESKEY4;					/*!< AES KEY REGISTER 4,					Address offset: 0x20 */	
	__IO uint32_t AESKEY5;					/*!< AES KEY REGISTER 5,					Address offset: 0x24 */	
	__IO uint32_t AESKEY6;					/*!< AES KEY REGISTER 6,					Address offset: 0x28 */
	__IO uint32_t AESKEY7;					/*!< AES KEY REGISTER 7,					Address offset: 0x2C */
	__IO uint32_t AESIVR0;					/*!< AES INITIAL DATA REGISTER 0,			Address offset: 0x30 */
	__IO uint32_t AESIVR1;					/*!< AES INITIAL DATA REGISTER 1,			Address offset: 0x34 */
	__IO uint32_t AESIVR2;					/*!< AES INITIAL DATA REGISTER 2,			Address offset: 0x38 */
	__IO uint32_t AESIVR3;					/*!< AES INITIAL DATA REGISTER 3,			Address offset: 0x3C */
} AES_Type;

/* ================================================================================ */
/* ================                      U7816                      ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t U7816CTRL;   			/*!< U7816 CONTROL REGISTER,    					Address offset: 0x00 */
	__IO uint32_t U7816FRC;   			/*!< U7816 FRAME CONTROL REGISTER, 				Address offset: 0x04 */
	__IO uint32_t U7816EGT;  				/*!< U7816 EGT CONFIG REGISTER,  					Address offset: 0x08 */
	__IO uint32_t U7816CLKDIV;			/*!< U7816 CLK DIVIDED REGISTER,      		Address offset: 0x0C */
	__IO uint32_t U7816PDIV;				/*!< U7816 PREDIVIDED REGISTER,						Address offset: 0x10 */
	__IO uint32_t U7816RXBUF;				/*!< U7816 RX BUFFER REGISTER,	 					Address offset: 0x14 */
	__IO uint32_t U7816TXBUF;				/*!< U7816 TX BUFFER REGISTER,						Address offset: 0x18 */
	__IO uint32_t U7816IE;					/*!< U7816 INTERRUPT ENABLE REGISTER,			Address offset: 0x1C */	
	__IO uint32_t U7816IF;					/*!< U7816 INTERRUPT FLAG REGISTER,				Address offset: 0x20 */	
	__IO uint32_t U7816ERR;					/*!< U7816 ERR FLAG REGISTER,							Address offset: 0x24 */	
	__IO uint32_t U7816STA;					/*!< U7816 STATE REGISTER,								Address offset: 0x28 */
} U7816x_Type;

/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t WWDTCON;   				/*!< WWDT CONTROL REGISTER,    						Address offset: 0x00 */
	__IO uint32_t WWDTCFG;   				/*!< WWDT CONFIG REGISTER, 								Address offset: 0x04 */
	__IO uint32_t WWDTCNT;  				/*!< WWDT COUNTER REGISTER,  							Address offset: 0x08 */
	__IO uint32_t WWDTIE;						/*!< WWDT INTERRUPT ENABLE REGISTER,      Address offset: 0x0C */
	__IO uint32_t WWDTIF;						/*!< WWDT INTERRUPT FLAG REGISTER,				Address offset: 0x10 */
	__IO uint32_t WWDTDIV;						/*!< WWDT WWDTDIV REGISTER,				Address offset: 0x14 */
} WWDT_Type;

/* ================================================================================ */
/* ================                      TRNG                      ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t RSV0;   				/*!< RESERVED    						Address offset: 0x00 */
	__IO uint32_t RNGOUT;   			/*!< TRNG OUTPUT REGISTER, 				Address offset: 0x04 */
	__IO uint32_t RSV1;					/*!< RESERVED						    Address offset: 0x08 */	
	__IO uint32_t RNGIE;				/*!< TRNG INTERRUPT ENABLE REGISTER,    Address offset: 0x0C */
	__IO uint32_t RNGIF;				/*!< TRNG INTERRUPT FLAG REGISTER,		Address offset: 0x10 */
	__IO uint32_t CRCCON;				/*!< TRNG CRC CONTROL REGISTER,			Address offset: 0x14 */	
	__IO uint32_t CRCIN;				/*!< TRNG CRC INPUT REGISTER,			Address offset: 0x18 */	
	__IO uint32_t CRCFLAG;				/*!< TRNG CRC CRCFLAG REGISTER,			Address offset: 0x1C */	
} TRNG_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif

/* ================================================================================ */
/* ================              CPU memory map                    ================ */
/* ================================================================================ */
/* Peripheral and SRAM base address */
#define FLASH_BASE            ((     uint32_t)0x00000000)
#define SRAM_BASE             ((     uint32_t)0x20000000)
#define PERIPH_BASE           ((     uint32_t)0x40000000)

/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */
/* Peripheral memory map */
#define SCU_BASE						(PERIPH_BASE				+0x00000000)
#define PMU_BASE						(PERIPH_BASE				+0x00000100)
#define RCC_BASE						(PERIPH_BASE				+0x00000200)
#define DMA_BASE						(PERIPH_BASE				+0x00000400)
#define HSPI_BASE						(PERIPH_BASE				+0x00000800)
#define SPI1_BASE						(PERIPH_BASE				+0x00000840)
#define SPI2_BASE						(PERIPH_BASE				+0x00000880)

